---
kind: property
id: P:Autodesk.Revit.DB.LinkLoadResult.LoadResult
source: html/ae6b4803-6e9d-46fa-186b-9756654772e7.htm
---
# Autodesk.Revit.DB.LinkLoadResult.LoadResult Property

Holds the results of creating or loading a link. Results can be LinkLoadResultType.LinkLoaded
 for success, or a variety of errors. See LinkLoadResultType for the full list.

## Syntax (C#)
```csharp
public LinkLoadResultType LoadResult { get; }
```